{"id":15616,"date":"2023-08-03T13:44:16","date_gmt":"2023-08-03T13:44:16","guid":{"rendered":"https:\/\/www.screeningdate.com\/?p=10643"},"modified":"2024-03-30T17:22:58","modified_gmt":"2024-03-30T17:22:58","slug":"leiden-university-excellence-scholarship","status":"publish","type":"post","link":"https:\/\/applyjobs.org.ng\/leiden-university-excellence-scholarship\/","title":{"rendered":"Leiden University Masters Scholarship, Netherland 2024"},"content":{"rendered":"<div>\n<p>Find Masters Scholarship in Netherland, Leiden University Excellence Scholarships for Masters 2024. Find details here.<\/p><div id=\"ez-toc-container\" class=\"ez-toc-v2_0_65 ez-toc-wrap-center counter-hierarchy ez-toc-counter ez-toc-light-blue ez-toc-container-direction\">\n<div class=\"ez-toc-title-container\">\n<p class=\"ez-toc-title \" >Contents on This Page<\/p>\n<span class=\"ez-toc-title-toggle\"><a href=\"#\" class=\"ez-toc-pull-right ez-toc-btn ez-toc-btn-xs ez-toc-btn-default ez-toc-toggle\" aria-label=\"Toggle Table of Content\"><span class=\"ez-toc-js-icon-con\"><span class=\"\"><span class=\"eztoc-hide\" style=\"display:none;\">Toggle<\/span><span class=\"ez-toc-icon-toggle-span\"><svg style=\"fill: #999;color:#999\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" class=\"list-377408\" width=\"20px\" height=\"20px\" viewBox=\"0 0 24 24\" fill=\"none\"><path d=\"M6 6H4v2h2V6zm14 0H8v2h12V6zM4 11h2v2H4v-2zm16 0H8v2h12v-2zM4 16h2v2H4v-2zm16 0H8v2h12v-2z\" fill=\"currentColor\"><\/path><\/svg><svg style=\"fill: #999;color:#999\" class=\"arrow-unsorted-368013\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" width=\"10px\" height=\"10px\" viewBox=\"0 0 24 24\" version=\"1.2\" baseProfile=\"tiny\"><path d=\"M18.2 9.3l-6.2-6.3-6.2 6.3c-.2.2-.3.4-.3.7s.1.5.3.7c.2.2.4.3.7.3h11c.3 0 .5-.1.7-.3.2-.2.3-.5.3-.7s-.1-.5-.3-.7zM5.8 14.7l6.2 6.3 6.2-6.3c.2-.2.3-.5.3-.7s-.1-.5-.3-.7c-.2-.2-.4-.3-.7-.3h-11c-.3 0-.5.1-.7.3-.2.2-.3.5-.3.7s.1.5.3.7z\"\/><\/svg><\/span><\/span><\/span><\/a><\/span><\/div>\n<nav><ul class='ez-toc-list ez-toc-list-level-1 eztoc-toggle-hide-by-default' ><li class='ez-toc-page-1 ez-toc-heading-level-2'><a class=\"ez-toc-link ez-toc-heading-1\" href=\"https:\/\/applyjobs.org.ng\/leiden-university-excellence-scholarship\/#Scholarship_Coverage\" title=\"Scholarship Coverage\">Scholarship Coverage<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-2'><a class=\"ez-toc-link ez-toc-heading-2\" href=\"https:\/\/applyjobs.org.ng\/leiden-university-excellence-scholarship\/#Scholarship_Summary\" title=\"Scholarship Summary\">Scholarship Summary<\/a><ul class='ez-toc-list-level-3' ><li class='ez-toc-heading-level-3'><a class=\"ez-toc-link ez-toc-heading-3\" href=\"https:\/\/applyjobs.org.ng\/leiden-university-excellence-scholarship\/#Eligibility_Criteria_for_Leiden_University_Excellence_Scholarship\" title=\"Eligibility Criteria for Leiden University Excellence Scholarship\">Eligibility Criteria for Leiden University Excellence Scholarship<\/a><\/li><\/ul><\/li><li class='ez-toc-page-1 ez-toc-heading-level-2'><a class=\"ez-toc-link ez-toc-heading-4\" href=\"https:\/\/applyjobs.org.ng\/leiden-university-excellence-scholarship\/#How_to_Apply_for_Leiden_University_Excellence_Scholarship\" title=\"How to Apply for Leiden University Excellence Scholarship?\">How to Apply for Leiden University Excellence Scholarship?<\/a><\/li><\/ul><\/nav><\/div>\n\n<h2 id=\"scholarship-coverage\"><span class=\"ez-toc-section\" id=\"Scholarship_Coverage\"><\/span>Scholarship Coverage<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>Leiden University Excellence Scholarship (LexS) provides the recipient with the following benefits:<\/p>\n<ul>\n<li>€ 15,000 of the tuition fee<\/li>\n<li>€ 10,000 of the tuition fee<\/li>\n<li>Total tuition fee minus the statutory tuition fee<\/li>\n<\/ul>\n<h2 id=\"scholarship-summary\" dir=\"ltr\"><span class=\"ez-toc-section\" id=\"Scholarship_Summary\"><\/span>Scholarship Summary<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<ul>\n<li><strong>Level of Study: <\/strong>Masters<\/li>\n<li><strong>Institution(s): <\/strong>Leiden University<\/li>\n<li><strong>Study in:<\/strong> Netherlands<\/li>\n<li><b>Courses Offered: <\/b>All Masters programs in the following Faculties: Humanities, Archaeology, Medicine\/LUMC, Law, Social and Behavioral Sciences, Governance and Global Affairs, Science, Interfacultair Centrum voor Lerarenopleiding, Onderwijsontwikkeling en Nascholing (ICLON), African Studies Centre, International Institute for Asian Studies.<\/li>\n<li><strong>Program Period: <\/strong>The maximum study period for a 1-year program is 12 months. The maximum study period for a 2-year program is 24 months.<\/li>\n<li><b><strong>Deadline: <\/strong><\/b>1 Feb for programmes starting 1 Sept \/ 1 Oct for programmes starting 1 February<\/li>\n<\/ul>\n<p>Read Also&gt;&gt;&gt;&gt;<a href=\"https:\/\/www.applyjobs.org.ng\/how-to-keep-to-your-screening-interview-date\/\" rel=\"nofollow noopener\" target=\"_blank\">How to Keep to your Screening &amp; Interview Date<\/a><\/p>\n<\/div>\n<h3 id=\"eligibility-criteria-for-leiden-university-excellence-scholarship\"><span class=\"ez-toc-section\" id=\"Eligibility_Criteria_for_Leiden_University_Excellence_Scholarship\"><\/span>Eligibility Criteria for Leiden University Excellence Scholarship<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>To qualify for a Leiden University Excellence Scholarship (LexS), candidates must fulfill all of the following requirements below:<\/p>\n<ul>\n<li><strong>Required Language:<\/strong> English<\/li>\n<li><strong>Eligible Countries:<\/strong> Non-EU\/EEA international students<\/li>\n<li>In prior academic education, the student must have achieved excellent study results which are relevant for the program for which the student wishes to enrol. As an indication, the student will be among the top 10% for the relevant program followed abroad.<\/li>\n<li>Students must have achieved excellent study results in their previous education, this being relevant to the Master’s program for which they are applying. As an indication, the student is among the top 10% of graduates in his\/her previous study program. <em>Note: proof of ranking is not required – this information is purely to indicate the level of competitiveness.<\/em><\/li>\n<li>The student will hold a non-EU\/EEA passport and will not be eligible for support under the Dutch system of study grants and loans “Studiefinanciering”. For more information please refer to: www.duo.nl. This does not apply to the Advanced Masters, application for the LExS for these program is open to all nationalities.<\/li>\n<li>Continuation of the LExS is not guaranteed when a student changes his or her degree program during the study program. Requests will be reviewed case by case and the final decision will be taken by the Faculty Selection Committee(s). In case the change is before the student has registered for the study program, the LExS scholarship will be revoked and the student will have to re-apply for the scholarship.<\/li>\n<li> The LExS is only valid for the period the student is registered at Leiden University as a full time student within the time frame of the study program.<\/li>\n<li>A LExS granted for the academic year as specified in the decision letter cannot be transferred to another academic year or to a next intake within the same academic year. In case a student has been awarded a LExS for the September (or February) intake and decides to postpone his\/her participation in the study program, the LExS will be revoked. Requests will be reviewed case by case and the final decision will be taken by the Faculty Selection Committee(s).<\/li>\n<li>The student is not permitted to receive any additional full scholarship for the same program, other than in the case of partial scholarships, where this has to be confirmed in writing in advance. The student should notify the Leiden University if another full scholarship such as the Netherlands Fellowship Program, Jean Monnet etc. has been awarded and which scholarship has been accepted.<\/li>\n<li> For a program lasting more than one year, the student is required to obtain a minimum of 60 ECTS in the first year of study in order to retain the right to LExS for the following academic year. In cases where there is any uncertainty as to the number of ECTS standards for satisfactory progress and the time and manner in which progress will be measured will be set by the Leiden University Selection Committee.<\/li>\n<li>A student is allowed to submit several applications for scholarships at one time. However, it is not possible to combine scholarships which are provided or sponsored by Leiden University. This concerns the following scholarship programs: Orange Tulip – China and CEU Praesidium Libertatis. Also it is not possible to combine the LExS with scholarships which are provided on a bilateral agreement with educational institutions, or any other scholarship which might be provided or sponsored by Leiden University in the near future<\/li>\n<li> The student must comply with Dutch visa regulations.<\/li>\n<li>The LExS will not be awarded to students who are admitted to a second Master program at Leiden University with the exception of students applying for a Master program for which a specified previous Master program or work experience is mandatory.<\/li>\n<li>Leiden University should be notified as soon as possible of any change in nationality, type of residence permit, and\/or possible “Studiefinanciering” support, throughout the academic year.<\/li>\n<li> If the student terminates the study prematurely, any requests for reimbursement of tuition fees will be made to Leiden University and analogues to the “Regeling inschrijving, college- en examengeld” for the applicable academic year. The student should submit the de registration form to Leiden University. If applicable, the student will subsequently receive a reimbursement of the tuition fee less the<br \/>\nscholarship on a pro rata basis.<\/li>\n<li> During the study at Leiden University the student will take an active part in activities to promote the LExS.<\/li>\n<li> The student has to accept the granted LExS scholarship by filling out the ‘Acceptance Form LExS’.<\/li>\n<\/ul>\n<div id=\"content\" class=\"content\" role=\"main\">\n<article id=\"post-85063\" class=\"post-85063 post type-post status-publish format-standard has-post-thumbnail category-degree-scholarships category-post-doc tag-i-am-not-sure-whether-this-ooportunity-is-fully-funded-or-not tag-in-the-apply-now-link-i-couldnt-find-the-application-link-because-its-not-available-yet-so-i-put-the-link-which-was-in-the-official-website-of-the-online-application-but-its-not-uploaded-yet tag-salma-aladdin regions-australia regions-australia-oceania funding-type-fullyfunded nationality-algeria-en nationality-bahrain-en nationality-comoros-en nationality-cyprus-en nationality-djibouti-en nationality-egypt-en nationality-iran-en nationality-iraq-en nationality-jordan-en nationality-kuwait-en nationality-lebanon-en nationality-libya-en nationality-mauritania-en nationality-morocco-en nationality-oman-en nationality-palestine-en nationality-qatar-en nationality-saudi-arabia-en nationality-somalia-en nationality-sudan-en nationality-syria-en nationality-tunisia-en nationality-turkey-en nationality-uae-en nationality-yemen-en fields-type-accounting-en fields-type-aerospace-engineering fields-type-agriculture-and-veterinary-medicine fields-type-agriculture fields-type-anthropology fields-type-applied-and-pure-sciences-en fields-type-archaeology fields-type-architecture fields-type-architecture-construction-en fields-type-art fields-type-astronomy fields-type-biology fields-type-biomedical-engineering fields-type-biomedical-sciences fields-type-business-and-management fields-type-business-studies fields-type-chemical-and-materials-engineering fields-type-chemistry fields-type-civil-engineering fields-type-computer-science-and-it fields-type-computing fields-type-crafts-en fields-type-creative-arts-and-desgin fields-type-criminal-law fields-type-cultural-and-critical-studies fields-type-demography fields-type-dentistry fields-type-development-studies fields-type-economics fields-type-education-and-training fields-type-electrical-engineering-en fields-type-engineering-en fields-type-environmental-engineering fields-type-film-television fields-type-finance fields-type-health-and-medicine fields-type-health-and-safety fields-type-health-studies-health-and-medicine fields-type-history fields-type-horticulture fields-type-human-geography fields-type-humanities fields-type-industrial-design fields-type-interior-design-en fields-type-international-law fields-type-journalism fields-type-languages fields-type-law-en fields-type-legal-advice fields-type-library-studies fields-type-linguistics fields-type-literature fields-type-management fields-type-manufacturing-and-production fields-type-marketing fields-type-mathematical-science fields-type-mechanical-engineering fields-type-mechatronics-engineering fields-type-media fields-type-medicine fields-type-musical-arts fields-type-nursing fields-type-nutrition-and-health fields-type-oncology fields-type-ophthalmology fields-type-personal-care-and-fitness fields-type-pharmacology fields-type-philosophy fields-type-physics fields-type-physiology fields-type-physiotherapy fields-type-planning fields-type-plant-and-crop-sciences-en fields-type-politics fields-type-psychology fields-type-public-administration fields-type-public-health fields-type-public-law fields-type-public-policy fields-type-religious-studies fields-type-social-studies-and-media fields-type-social-work fields-type-sociology fields-type-transportation-and-logistics fields-type-veterinary-medicine fields-type-writing category-340 category-798 description-off\">\n<div class=\"entry-content\">\n<h2 id=\"how-to-apply-for-leiden-university-excellence-scholarship\"><span class=\"ez-toc-section\" id=\"How_to_Apply_for_Leiden_University_Excellence_Scholarship\"><\/span>How to Apply for Leiden University Excellence Scholarship?<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>Please follow below instructions to avail this Leiden University Excellence Scholarship:<\/p>\n<\/div>\n<\/article>\n<\/div>\n<ul>\n<li><strong><a href=\"https:\/\/www.universiteitleiden.nl\/en\/education\/admission-and-application\" rel=\"nofollow noopener\" target=\"_blank\">Apply online for admission<\/a> <\/strong>to a Master’s program at Leiden University and pay the application fee if applicable.<\/li>\n<li>In the scholarship section of your online application, indicate that you wish to apply for a LExS.<\/li>\n<li>Upload your LExS motivation letter as instructed in your online application. This is a Word doc of max. 500 words, in which you explain why you would like to be considered for the award.<\/li>\n<li>Submit your online application, containing your LExS application, before the LExS application deadline.<\/li>\n<li>If you apply for more than one study program and wish to apply for a LExS for each, indicate this clearly in each application and upload a LExS motivation letter for each.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"Find Masters Scholarship in Netherland, Leiden University Excellence Scholarships for Masters 2024. Find details here. Scholarship Coverage Leiden&hellip;\n","protected":false},"author":1,"featured_media":16563,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[14],"tags":[818],"_links":{"self":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/posts\/15616"}],"collection":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/comments?post=15616"}],"version-history":[{"count":0,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/posts\/15616\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/media\/16563"}],"wp:attachment":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/media?parent=15616"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/categories?post=15616"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/tags?post=15616"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}