{"id":2323,"date":"2023-04-14T16:08:04","date_gmt":"2023-04-14T16:08:04","guid":{"rendered":"http:\/\/localhost:10011\/?p=2323"},"modified":"2024-03-30T17:23:20","modified_gmt":"2024-03-30T17:23:20","slug":"rhodes-university-application-form","status":"publish","type":"post","link":"https:\/\/applyjobs.org.ng\/rhodes-university-application-form\/","title":{"rendered":"Rhodes University Application Form 2024 | Login here!"},"content":{"rendered":"<div id=\"ctl00_ContentPlaceHolder1_pnlStudyOptions\">\n<div id=\"CareerGuidance\">\n<p><strong>Here is the Official Rhodes University Mahikeng Application Form-Download PDF Form and Prospectu<\/strong><strong>s, <\/strong><strong>Start Filling and Summit for full Admission Registration<\/strong><\/p><div id=\"ez-toc-container\" class=\"ez-toc-v2_0_64 ez-toc-wrap-center counter-hierarchy ez-toc-counter ez-toc-light-blue ez-toc-container-direction\">\n<div class=\"ez-toc-title-container\">\n<p class=\"ez-toc-title \" >Contents on This Page<\/p>\n<span class=\"ez-toc-title-toggle\"><a href=\"#\" class=\"ez-toc-pull-right ez-toc-btn ez-toc-btn-xs ez-toc-btn-default ez-toc-toggle\" aria-label=\"Toggle Table of Content\"><span class=\"ez-toc-js-icon-con\"><span class=\"\"><span class=\"eztoc-hide\" style=\"display:none;\">Toggle<\/span><span class=\"ez-toc-icon-toggle-span\"><svg style=\"fill: #999;color:#999\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" class=\"list-377408\" width=\"20px\" height=\"20px\" viewBox=\"0 0 24 24\" fill=\"none\"><path d=\"M6 6H4v2h2V6zm14 0H8v2h12V6zM4 11h2v2H4v-2zm16 0H8v2h12v-2zM4 16h2v2H4v-2zm16 0H8v2h12v-2z\" fill=\"currentColor\"><\/path><\/svg><svg style=\"fill: #999;color:#999\" class=\"arrow-unsorted-368013\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\" width=\"10px\" height=\"10px\" viewBox=\"0 0 24 24\" version=\"1.2\" baseProfile=\"tiny\"><path d=\"M18.2 9.3l-6.2-6.3-6.2 6.3c-.2.2-.3.4-.3.7s.1.5.3.7c.2.2.4.3.7.3h11c.3 0 .5-.1.7-.3.2-.2.3-.5.3-.7s-.1-.5-.3-.7zM5.8 14.7l6.2 6.3 6.2-6.3c.2-.2.3-.5.3-.7s-.1-.5-.3-.7c-.2-.2-.4-.3-.7-.3h-11c-.3 0-.5.1-.7.3-.2.2-.3.5-.3.7s.1.5.3.7z\"\/><\/svg><\/span><\/span><\/span><\/a><\/span><\/div>\n<nav><ul class='ez-toc-list ez-toc-list-level-1 eztoc-toggle-hide-by-default' ><li class='ez-toc-page-1 ez-toc-heading-level-2'><a class=\"ez-toc-link ez-toc-heading-1\" href=\"https:\/\/applyjobs.org.ng\/rhodes-university-application-form\/#How_to_Download_Rhodes_University_Mahikeng_Application_Form_2024_PDF\" title=\"How to Download Rhodes University Mahikeng Application Form 2024 PDF\">How to Download Rhodes University Mahikeng Application Form 2024 PDF<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-2'><a class=\"ez-toc-link ez-toc-heading-2\" href=\"https:\/\/applyjobs.org.ng\/rhodes-university-application-form\/#How_to_apply_through_CAO_2024\" title=\"How to apply through CAO 2024\">How to apply through CAO 2024<\/a><ul class='ez-toc-list-level-3' ><li class='ez-toc-heading-level-3'><a class=\"ez-toc-link ez-toc-heading-3\" href=\"https:\/\/applyjobs.org.ng\/rhodes-university-application-form\/#Terms_and_Conditions\" title=\"Terms and Conditions\">Terms and Conditions<\/a><ul class='ez-toc-list-level-6' ><li class='ez-toc-heading-level-6'><ul class='ez-toc-list-level-6' ><li class='ez-toc-heading-level-6'><ul class='ez-toc-list-level-6' ><li class='ez-toc-heading-level-6'><a class=\"ez-toc-link ez-toc-heading-4\" href=\"https:\/\/applyjobs.org.ng\/rhodes-university-application-form\/#CAO_to_the_best_of_its_ability_attempts_to_ensure_that_the_information_provided_is_both_true_and_correct_free_from_error_omission_or_misrepresentation_however_does_not_warrant_the_aforesaid_expressly_or_implied\" title=\"CAO, to the best of its ability, attempts to ensure that the information provided is both true and correct, free from error, omission, or misrepresentation, however, does not warrant the aforesaid expressly or implied\">CAO, to the best of its ability, attempts to ensure that the information provided is both true and correct, free from error, omission, or misrepresentation, however, does not warrant the aforesaid expressly or implied<\/a><\/li><li class='ez-toc-page-1 ez-toc-heading-level-6'><a class=\"ez-toc-link ez-toc-heading-5\" href=\"https:\/\/applyjobs.org.ng\/rhodes-university-application-form\/#pls_kindly_use_the_comment_box_below_if_there_is_any_Question_or_correction_you_want_to_make_we_the_applyjobsorgng_team_will_respond_ASAP\" title=\"pls kindly use the comment box below if there is any Question or correction you want to make we, the applyjobs.org.ng team will respond ASAP.\">pls kindly use the comment box below if there is any Question or correction you want to make we, the applyjobs.org.ng team will respond ASAP.<\/a><\/li><\/ul><\/li><\/ul><\/li><\/ul><\/li><\/ul><\/li><\/ul><\/nav><\/div>\n\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2140\" src=\"https:\/\/applyjobs.org.ng\/wp-content\/uploads\/2024\/11\/Rhodes-University.jpg\" alt=\"\" width=\"225\" height=\"225\" title=\"\"><\/p>\n<\/div>\n<div id=\"CareerGuidance\">\n<h2 id=\"how-to-download-rhodes-university-mahikeng-application-form-2024-pdf\"><span class=\"ez-toc-section\" id=\"How_to_Download_Rhodes_University_Mahikeng_Application_Form_2024_PDF\"><\/span>How to Download Rhodes University Mahikeng Application Form 2024 PDF<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<p>Rhodes University Mahikeng applications 2024 can be downloaded at the Rhodes University Mahikeng ’s website(Rhodes University Mahikeng Student Portal): Please visit Rhodes University Mahikeng website for instructions on how to download the form and apply online<\/p>\n<h2 id=\"how-to-apply-through-cao-2024\"><span class=\"ez-toc-section\" id=\"How_to_apply_through_CAO_2024\"><\/span>How to apply through CAO 2024<span class=\"ez-toc-section-end\"><\/span><\/h2>\n<div>Enter your CAO number, ID number, or Results to see what programs you may qualify for at our member institutions.<\/div>\n<div><\/div>\n<\/div>\n<\/div>\n<table id=\"ctl00_ContentPlaceHolder1_DynamicContent\" border=\"0\" cellspacing=\"0\">\n<tbody>\n<tr>\n<td>\n<h3 id=\"terms-and-conditions\"><span class=\"ez-toc-section\" id=\"Terms_and_Conditions\"><\/span>Terms and Conditions<span class=\"ez-toc-section-end\"><\/span><\/h3>\n<p>1. Submit your application as soon as possible.<\/p>\n<p>2. We process applications for our member institutions from 1 March for the following year&#8217;s January (First Semester) intake. We process applications for member universities that have a 2nd Semester intake from August for the following year&#8217;s July (Second Semester) intake.<\/p>\n<p>3. In addition to Semester Programmes, TVET colleges also offer trimester programs. Applications for these will be received at various points in the year. See the CAO website for details, or call us for more information, or call the TVET College directly.<\/p>\n<p>4. If you are currently in Grade 12, you must submit your;<\/p>\n<p>4.1 Final Grade 11 Results and;<\/p>\n<p>4.2 a certified copy of your ID with your application.<\/p>\n<p>4.3 After June, you must also submit your mid-year results and after September, you must also submit your Grade 12 Trials results.<\/p>\n<p>We add each result and document to your original application and make copies of all your documents as we receive them and make them available to all the institutions to which you apply. If, after you have submitted your original application you inform us that you have changed your email address or cellphone number, or residential address, we make the necessary changes on your original application and inform the institutions to which you have applied.5. If you are not currently in Grade 12 but have completed Grade 12 previously, you must apply as early in the year preceding the year of entry by:<\/p>\n<p>5.1 Completing and submitting your application together with;<\/p>\n<p>5.2 a certified copy of your Grade 12 Statement of Results or National Senior Certificate;<\/p>\n<p>5.3 a certified copy of your ID. If you don’t have a copy of your ID you must provide your ID number on the online or hard copy application and submit a certified copy of your ID as soon as you receive it.<\/p>\n<p>5.4 If you are applying to a TVET college, you must send a certified copy of the results of the last grade you have passed at school.<\/p>\n<p>5.5 If you have upgraded one or more of your subjects, send us a certified copy of your Combined Statement\/Certificate of Results.<\/p>\n<p>email address and cellular phone number. Selection decisions are communicated via SMS, and all letters, for example, offer letters, are communicated first by email. Only if you do not provide an email address will we send letters by fax or post (in that order).6. Institutions inform us that the earlier in the year you apply, the earlier you are considered for a place&#8230;<\/p>\n<p>7. Make sure that the ID number and name and surname you use on your application form are exactly the same as the one you use when you register for your Final Grade 12 Examination. If it differs, we will not be able to download your final examination results from the Department of Basic Education (DBE) database and match them to your application information at the institution.<\/p>\n<p>8. An application is considered to be valid only once the full application (hard copy or online), including the program choices, signed Declaration, and Informed Consent as well as the full application fee has been received by the CAO. Only then will it be processed and made available to institutions.<\/p>\n<p>9. The official Received Date for the application will be the date on which the completed application &#8211; with program choices, full payment, declaration, and informed consent has been received. Applicant and application information will be sent to institutions only once these terms and conditions have been met.<\/p>\n<p>10. Application and Change of Mind fees are not refundable.<\/p>\n<p>11. Please provide the correct email and cell phone number as all messages are sent to you by email\/SMS. We can only communicate messages with you via email if you have supplied an email address and via cell if no email address is provided (the email\/cell phone number that you provide on your original application form or the one you may have changed via written communication with us and that we have confirmed that it has been changed).<\/p>\n<p>12. At four weeks after we receive your valid application, we will send you an Acknowledgement Letter by email in which we acknowledge that we have received and processed your a<span style=\"font-family: inherit; font-size: inherit;\">pplication form<\/span>. If no email address is provided, the communication will be sent by fax, and if no fax numbers are provided, letters will be sent by post. Applicants are encouraged to use a valid email address for communication since this is the quickest and most reliable way that they will receive letters. Posting letters is the last resort. See Electronic Communications and Transactions Act, 2002 on www.gov.za regarding emailed documents.<\/p>\n<p>13. The Acknowledgement Letter will have all the details you have provided on your application. Applicants are fully responsible for checking their Acknowledgement Letters and informing the CAO of any errors, omissions or changes.<\/p>\n<p>14. If you do not inform us of errors, omissions, or changes within two weeks after we have sent you the Acknowledgement Letter, we shall accept that all the information in the Acknowledgement Letter is correct and as complete as you want it to be.<\/p>\n<p>15. If you have not received an Acknowledgement Letter within four weeks after you have applied, please enquire if the CAO has received your application (See page 3 of the 2019 Entry Handbook for contact details).<\/p>\n<p>16. We provide your information to institutions electronically. The institutions have full and final responsibility for selection and admission decisions, not the CAO.<\/p>\n<p>17. Selection decisions we receive from institutions we pass on to applicants as soon as we receive them from the institutions. The institutions may also contact the applicant directly.<\/p>\n<p>18. Institutions start making offers early in the year preceding the year of entry. It is in your best interest to submit your valid application as early as possible.<\/p>\n<p>19. You will receive an SMS, a letter (either by email, fax or post) to inform you of any offers that you have been made by an institution to which you have applied. Try your best to have an email address to which we can send offer letters as institutions often have a cut-off date for receiving from the applicant confirmation of the acceptance of an offer. If the offer is not accepted within the stipulated period the institution reserves the right to withdraw the offer.<\/p>\n<p>20. Offers to study may be withdrawn if:<\/p>\n<p>• You don’t – within the period stipulated by the institution &#8211; tell the institution you want to accept the offeror;<\/p>\n<p>• The conditions of the offer are not met; and\/or<\/p>\n<p>• The institution discovers that you have provided false information in your application, e.g. you have not declared that you have previously studied at that or another institution.<\/p>\n<p>21. You will only receive either an email or SMS to inform you that you have been unsuccessful in any of the program choices you applied for.<\/p>\n<p>22. Applicants should apply and pay on or before the published closing dates. Applications received after these dates will be considered as Late Applications and each institution has its own rules and procedures on how they deal with applications received after the closing date.<\/p>\n<p>23. If, after you have applied, you want to change your qualifications\/program choices, you may complete a Change of Mind Request Form (COM) and choose different qualifications\/programs. These forms can be downloaded from our website or requested from our Call Centre.<\/p>\n<p>24. A-COM will only be processed once we have received the COM fee (See page 171 of the 2019 Entry Handbook for fee structure). Alternatively, click on ‘Application Fee’ on the CAO Home Page.<\/p>\n<p>25. Any number of programme changes\/additions (up to six programmes) on the same Change of Mind Request Form is considered as one for payment purposes.<\/p>\n<p>26. If you submit qualification\/program changes\/additions on more than one Change of Mind Request Form and\/or at different times, each Change of Mind Request Form submission will be regarded as a separate request and a fee must be paid for each submission, not for each qualification\/program change.<\/p>\n<p>27. Payment\/s for multiple COM Request Form submissions will be allocated and processed strictly in the sequence that the COM Request Forms were received.<\/p>\n<p>28. Every attempt has been made to ensure that the information in this Handbook is accurate and up to date at the time of going to print. However, institutions continually update their programs and entry requirements.<\/p>\n<p>29. During the course of the year, institutions may make available new programs that were not finalized in time to be included in this Handbook – check our website www.cao.ac.za, Facebook page or contact our Call Centre on 0860 860 226 or 031 268 4444 for updates. At the time of going to print, only a few skills training and leadership programs were included in this Handbook. Please check the website or contact us during the course of the year to find out about other available TVET skills training and leadership programs or contact the TVET College directly.<\/p>\n<p>30. An entry in this Handbook does not oblige the institution to offer the program as institutions continually assess their programs and may decide to discontinue programs during an application cycle. If an institution discontinues a program that is published in this Handbook, the applicant may change such a program at no cost to them.<\/p>\n<p>31. Specified entry requirements are guidelines used by institutions and each institution sets its own minimum entry requirements.<\/p>\n<p>32. Entry requirements published in the Handbook are MINIMUM requirements for your application to be considered; and in most cases, the number of applications for a qualification\/program far exceeds the number of places that an institution has available for the qualification\/program. Therefore, while you may meet the published minimum entry requirements, it does not guarantee acceptance.<\/p>\n<p>33. All payments to the CAO is done through EasyPay or by providing us with the information requested on the application form or pay online at www.cao.ac.za and click on ‘My Application’. The CAO does not take responsibility for payments in any other manner.<\/p>\n<p>34. CAO, its Administration departments, staff or any affiliated persons who provide information to the institutions, public and or prospective students provides such information, whether written or oral, in good faith. In the event that the public and\/ or prospective students act upon such information to their detriment, CAO shall not be liable for any loss, harm or damage (direct, consequential or special), or expense of any nature whatsoever, which may be suffered as a result of reliance on such information, the interpretation thereof or any references made thereto.<\/p>\n<h6 id=\"cao-to-the-best-of-its-ability-attempts-to-ensure-that-the-information-provided-is-both-true-and-correct-free-from-error-omission-or-misrepresentation-however-does-not-warrant-the-aforesaid-exp\" style=\"text-align: left;\"><span class=\"ez-toc-section\" id=\"CAO_to_the_best_of_its_ability_attempts_to_ensure_that_the_information_provided_is_both_true_and_correct_free_from_error_omission_or_misrepresentation_however_does_not_warrant_the_aforesaid_expressly_or_implied\"><\/span><span id=\"ctl00_ContentPlaceHolder1_DynamicContent_ctl00_htmltextLabel\"><em>CAO, to the best of its ability, attempts to ensure that the information provided is both true and correct, free from error, omission, or misrepresentation, however, does not warrant the aforesaid expressly or implied<\/em><\/span><span class=\"ez-toc-section-end\"><\/span><\/h6>\n<h6 id=\"pls-kindly-use-the-comment-box-below-if-there-is-any-question-or-correction-you-want-to-make-we-the-applyjobs-org-ng-team-will-respond-asap\" style=\"text-align: left;\"><span class=\"ez-toc-section\" id=\"pls_kindly_use_the_comment_box_below_if_there_is_any_Question_or_correction_you_want_to_make_we_the_applyjobsorgng_team_will_respond_ASAP\"><\/span>pls kindly use the comment box below if there is any Question or correction you want to make we, the <a href=\"http:\/\/applyjobs.org.ng\" rel=\"nofollow noopener\" target=\"_blank\">applyjobs.org.ng<\/a> team will respond ASAP.<span class=\"ez-toc-section-end\"><\/span><\/h6>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false},"excerpt":{"rendered":"Here is the Official Rhodes University Mahikeng Application Form-Download PDF Form and Prospectus, Start Filling and Summit for&hellip;\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[12],"tags":[],"_links":{"self":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/posts\/2323"}],"collection":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/comments?post=2323"}],"version-history":[{"count":0,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/posts\/2323\/revisions"}],"wp:attachment":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/media?parent=2323"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/categories?post=2323"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/tags?post=2323"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}