{"id":35,"date":"2023-08-03T20:40:21","date_gmt":"2023-08-03T20:40:21","guid":{"rendered":"http:\/\/localhost:10011\/?page_id=35"},"modified":"2024-01-14T17:23:09","modified_gmt":"2024-01-14T17:23:09","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/applyjobs.org.ng\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\r\n\r\nYour privacy is important to us. It is <strong>ApplyJobs<\/strong>‘s policy to respect your privacy regarding any information we may collect from you across our website, <strong>applyjobs.org.ng<\/strong>, and other sites we own and operate.\r\n\r\nWe only ask for personal information when we truly need it to provide a service to you. We collect it by fair and lawful means, with your knowledge and consent. We also let you know why we’re collecting it and how it will be used.\r\n\r\nWe only retain collected information for as long as necessary to provide you with your requested service. What data we store, we’ll protect within commercially acceptable means to prevent loss and theft, as well as unauthorized access, disclosure, copying, use or modification.\r\n\r\nWe don’t share any personally identifying information publicly or with third-parties, except when required to by law.\r\n\r\nOur website may link to external sites that are not operated by us. Please be aware that we have no control over the content and practices of these sites, and cannot accept responsibility or liability for their respective privacy policies.\r\n\r\nYou are free to refuse our request for your personal information, with the understanding that we may be unable to provide you with some of your desired services.\r\n\r\nYour continued use of our website will be regarded as acceptance of our practices around privacy and personal information. If you have any questions about how we handle user data and personal information, feel free to contact us.\r\n\r\n\r\n\r\n&nbsp;","protected":false},"excerpt":{"rendered":"Your privacy is important to us. It is ApplyJobs‘s policy to respect your privacy regarding any information we may&hellip;\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/pages\/35"}],"collection":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/comments?post=35"}],"version-history":[{"count":0,"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/pages\/35\/revisions"}],"wp:attachment":[{"href":"https:\/\/applyjobs.org.ng\/wp-json\/wp\/v2\/media?parent=35"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}